In [2]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in /opt/conda/lib/python3.10/site-packages (0.5.0)
Requirement already satisfied: sqlparse in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: ipython-genutils in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: six in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: prettytable in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (3.7.0)
Requirement already satisfied: ipython in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (8.11.0)
Requirement already satisfied: sqlalchemy>=2.0 in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (2.0.7)
Requirement already satisfied: greenlet!=0.4.17 in /opt/conda/lib/python3.10/site-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.2)
Requirement already satisfied: typing-extensions>=4.2.0 in /opt/conda/lib/python3.10/site-packages (from sqlalchemy>=2.0->ipython-sql) (4.5.0)
Requirement already satisfied: pickleshare in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: jedi>=0.16 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.18.2)
Requirement already satisfied: pexpect>4.3 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (4.8.0)
Requirement already satisfied: stack-data in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.6.2)
Requirement already satisfied: decorator in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: backcall in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: pygments>=2.4.0 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (2.14.0)
Requirement already satisfied: matplotlib-inline in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: traitlets>=5 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (5.9.0)
Requirement already satisfied: prompt-toolkit!=3.0.37,<3.1.0,>=3.0.30 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (3.0.38)
Requirement already satisfied: wcwidth in /opt/conda/lib/python3.10/site-packages (from prettytable->ipython-sql) (0.2.6)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in /opt/conda/lib/python3.10/site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /opt/conda/lib/python3.10/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: asttokens>=2.1.0 in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (2.2.1)
Requirement already satisfied: executing>=1.2.0 in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (1.2.0)
Requirement already satisfied: pure-eval in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
WARNING: There was an error checking the latest version of pip.

In [3]:
%load_ext sql

In [4]:
!env | grep POST

POSTGRESQL_USER=reader
POSTGRESQL_PASSWORD=Miba2021

In [5]:
import os
USER = os.environ['POSTGRESQL_USER']
PASSWORD = os.environ['POSTGRESQL_PASSWORD']
POSTGRESQL_HOST = '10.129.0.25'
DBASE_NAME = 'demo'

In [6]:
CONNECT_DATA = 'postgresql://{}:{}@{}/{}'.format(
    USER,
    PASSWORD,
    POSTGRESQL_HOST,
    DBASE_NAME
)

In [7]:
%%sql $CONNECT_DATA
    SELECT * FROM pg_database

4 rows affected.

[(13760, 'postgres', 10, 6, 'en_US.UTF-8', 'en_US.UTF-8', False, True, -1, 13759, '726', '1', 1663, None),
 (1, 'template1', 10, 6, 'en_US.UTF-8', 'en_US.UTF-8', True, True, -1, 13759, '726', '1', 1663, '{=c/postgres,postgres=CTc/postgres}'),
 (13759, 'template0', 10, 6, 'en_US.UTF-8', 'en_US.UTF-8', True, False, -1, 13759, '726', '1', 1663, '{=c/postgres,postgres=CTc/postgres}'),
 (16384, 'demo', 10, 6, 'en_US.UTF-8', 'en_US.UTF-8', False, True, -1, 13759, '726', '1', 1663, '{=Tc/postgres,postgres=CTc/postgres,reader=c/postgres}')]

In [8]:
%sql SELECT tablename AS table FROM pg_tables WHERE tablename !~ '^(pg_|sql_)'

 * postgresql://reader:***@10.129.0.25/demo
8 rows affected.

[('boarding_passes',),
 ('aircrafts_data',),
 ('flights',),
 ('airports_data',),
 ('seats',),
 ('tickets',),
 ('ticket_flights',),
 ('bookings',)]

 For the given ticket_no 0005432312164, find: who and where flew.
Provide solutions in 3 ways:
- a query with subqueries (nested queries)
- a query with no subqueries and no joins
- a query with joins

a query with subqueries (nested queries):

In [34]:
%%sql
SELECT 
    t.passenger_name,
    (SELECT f.arrival_airport 
     FROM flights f 
     WHERE f.flight_id = tf.flight_id
    ) AS arrival_airport
FROM tickets t, ticket_flights tf
WHERE t.ticket_no = '0005432312164' 
AND t.ticket_no = tf.ticket_no;

 * postgresql://reader:***@10.129.0.25/demo
4 rows affected.

[('ALEKSEY GERASIMOV', 'EGO'),
 ('ALEKSEY GERASIMOV', 'EGO'),
 ('ALEKSEY GERASIMOV', 'DME'),
 ('ALEKSEY GERASIMOV', 'AAQ')]

a query with no subqueries and no joins:

In [22]:
%%sql
SELECT t.passenger_name, f.arrival_airport
FROM tickets t, flights f, ticket_flights tf
WHERE t.ticket_no = '0005432312164'
AND t.ticket_no=tf.ticket_no
AND tf.flight_id=f.flight_id;

 * postgresql://reader:***@10.129.0.25/demo
4 rows affected.

[('ALEKSEY GERASIMOV', 'EGO'),
 ('ALEKSEY GERASIMOV', 'EGO'),
 ('ALEKSEY GERASIMOV', 'DME'),
 ('ALEKSEY GERASIMOV', 'AAQ')]

a query with joins:

In [23]:
%%sql
SELECT t.passenger_name, f.arrival_airport
FROM tickets t
JOIN ticket_flights tf ON t.ticket_no = tf.ticket_no
JOIN flights f ON tf.flight_id = f.flight_id
WHERE t.ticket_no = '0005432312164';

 * postgresql://reader:***@10.129.0.25/demo
4 rows affected.

[('ALEKSEY GERASIMOV', 'EGO'),
 ('ALEKSEY GERASIMOV', 'EGO'),
 ('ALEKSEY GERASIMOV', 'DME'),
 ('ALEKSEY GERASIMOV', 'AAQ')]

2. Extend that solution about Mrs. 'ELLA DMITRIEVA'

Old solution:

In [19]:
%%sql $CONNECT_DATA
SELECT departure_airport, arrival_airport
FROM Flights
JOIN Ticket_flights USING (flight_id)
JOIN Tickets USING (ticket_no)
WHERE passenger_name = 'ELLA DMITRIEVA'

7 rows affected.

[('SVO', 'SVX'),
 ('DME', 'HMA'),
 ('HMA', 'DME'),
 ('SVX', 'SVO'),
 ('SVX', 'MQF'),
 ('MQF', 'SVX'),
 ('DME', 'UUS')]

Upgraded version to include cities:

In [20]:
%%sql
SELECT dep.city AS departure_city,arr.city AS arrival_city
FROM flights
JOIN ticket_flights USING (flight_id)
JOIN tickets USING (ticket_no)
JOIN airports dep ON flights.departure_airport = dep.airport_code
JOIN airports arr ON flights.arrival_airport = arr.airport_code
WHERE tickets.passenger_name = 'ELLA DMITRIEVA';

 * postgresql://reader:***@10.129.0.25/demo
7 rows affected.

[('Moscow', 'Yuzhno-Sakhalinsk'),
 ('Moscow', 'Khanty-Mansiysk'),
 ('Khanty-Mansiysk', 'Moscow'),
 ('Moscow', 'Yekaterinburg'),
 ('Yekaterinburg', 'Moscow'),
 ('Yekaterinburg', 'Magnetiogorsk'),
 ('Magnetiogorsk', 'Yekaterinburg')]

3. Output a grid: Aircraft model/Total number of seats.
Order by the number of seats.

In [32]:
%%sql
SELECT model, COUNT(seat_no) AS total_seats
FROM aircrafts
JOIN seats ON aircrafts.aircraft_code = seats.aircraft_code
GROUP BY model
ORDER BY total_seats;

 * postgresql://reader:***@10.129.0.25/demo
9 rows affected.

[('Cessna 208 Caravan', 12),
 ('Bombardier CRJ-200', 50),
 ('Sukhoi Superjet-100', 97),
 ('Airbus A319-100', 116),
 ('Boeing 737-300', 130),
 ('Airbus A320-200', 140),
 ('Airbus A321-200', 170),
 ('Boeing 767-300', 222),
 ('Boeing 777-300', 402)]